---
kind: method
id: M:Autodesk.Revit.DB.Electrical.DistributionSysTypeSet.Insert(Autodesk.Revit.DB.Electrical.DistributionSysType)
source: html/7f029d8e-2de0-9a92-2e28-0948681f0ba4.htm
---
# Autodesk.Revit.DB.Electrical.DistributionSysTypeSet.Insert Method

Insert the specified DistributionSys type into the set.

## Syntax (C#)
```csharp
public virtual bool Insert(
	DistributionSysType item
)
```

## Parameters
- **item** (`Autodesk.Revit.DB.Electrical.DistributionSysType`) - The DistributionSys type to be inserted into the set.

## Returns
Returns whether the DistributionSys type was inserted into the set.